In [54]:
# inporting numpy and pandas 
import numpy as np
import pandas as pd

In [55]:
dict1 = {
    "name":["ram", "mohan", "sohan", "mahesh"],
    "marks":[45,56,58,74],
    "city":["delhi","noida","gr.noida","ncr"]
}

In [56]:
df = pd.DataFrame(dict1)   # creating dataframe

In [57]:
df

     name  marks      city
0     ram     45     delhi
1   mohan     56     noida
2   sohan     58  gr.noida
3  mahesh     74       ncr

In [58]:
df.to_csv("class.csv", index = False)          # creating a csv file
                                           # index = False means there will be no indexing in csv file

In [59]:
df.head()      # few upper sample rows&column

     name  marks      city
0     ram     45     delhi
1   mohan     56     noida
2   sohan     58  gr.noida
3  mahesh     74       ncr

In [60]:
df.head(2)    # upper two rows&column

    name  marks   city
0    ram     45  delhi
1  mohan     56  noida

In [61]:
df.tail()    # few sample rows&column from buttom

     name  marks      city
0     ram     45     delhi
1   mohan     56     noida
2   sohan     58  gr.noida
3  mahesh     74       ncr

In [62]:
df.tail(2)    # lowest 2 row rows&column

     name  marks      city
2   sohan     58  gr.noida
3  mahesh     74       ncr

In [63]:
df.describe()    # used for statical analysis on numerical column

           marks
count   4.000000
mean   58.250000
std    11.954776
min    45.000000
25%    53.250000
50%    57.000000
75%    62.000000
max    74.000000